#include <iostream>
using namespace std;

int main() {
    system("chcp 65001");
    cout << "Смотри, как облаком живым\n"
            "Фонтан сияющий клубится;\n"
            "Как пламенеет, как дробится\n"
            "Его на солнце влажный дым.\n"
            "Лучом поднявшись к небу, он\n"
            "Коснулся высоты заветной —\n"
            "И снова пылью огнецветной\n"
            "Ниспасть на землю осужден.\n"
            "О смертной мысли водомет,\n"
            "О водомет неистощимый!\n"
            "Какой закон непостижимый\n"
            "Тебя стремит, тебя мятет?\n"
            "Как жадно к небу рвешься ты!..\n"
            "Но длань незримо-роковая,\n"
            "Твой луч упорный преломляя,\n"
            "Свергает в брызгах с высоты…" << endl;
    return 0;
}

